IDEA StatiCa Open Model
HangingAroundPatch.EndsType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 End type of the reinforcement bar - same for both ends
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public LongReinfEndType EndsType { get; set; }
Public Property EndsType As LongReinfEndType
	Get
	Set
public:
property LongReinfEndType EndsType {
	LongReinfEndType get ();
	void set (LongReinfEndType value);
}
Property Value
Type: LongReinfEndType
See Also
Reference
HangingAroundPatch Class
IdeaRS.OpenModel.Detail Namespace